Tekla.Structures.Dialog.StructuresDialogFilterAttribute
The StructuresDialogFilterAttribute class specifies the attribute name for which the
value of the attributed property will be used as a filter in Tekla Structures. The return
type of the attributed property must be boolean. The apply and modify operations will only
commit/update those attributes which either do not have a filter property defined or the
value of the filter property is true.

Tekla.Structures.Dialog.StructuresDialogFilterAttribute.#ctor(System.String)
Initializes a new StructuresDialogFilterAttribute instance.
attributeName: The attribute name of the attributed property.

Tekla.Structures.Dialog.StructuresDialogFilterAttribute.AttributeName
Gets the attribute name of the property.

Tekla.Structures.Dialog.StructuresDialogFilterAttribute.ToString
Returns a string that represents the current StructuresDialogFilterAttribute object.
Returns: A string that represents the current StructuresDialogFilterAttribute object.